In [1]:
import pandas as pd
from scipy import stats

# Problem 1

In [2]:
cutlet=pd.read_csv('Cutlets.csv')
cutlet.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [3]:
stats.ttest_ind(cutlet['Unit A'],cutlet['Unit B'])

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

since pvalue greater than 0.05 ,hence Null hypothesis is accepted

## Problem 2

In [4]:
Lab=pd.read_csv('LabTAT.csv')
Lab.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [5]:
stats.f_oneway(Lab['Laboratory 1'],Lab['Laboratory 2'],Lab['Laboratory 3'],Lab['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

since p value is less than 0.05 hence reject null hypothesis and Alternate hypothesis is accepted.

## problem 3

In [6]:
buyerData=pd.read_csv('BuyerRatio.csv')

In [7]:
buyerData

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [8]:
stats.chi2_contingency(buyerData.iloc[:,1:])

Chi2ContingencyResult(statistic=1.595945538661058, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

since pvalue greater than 0.05 ,hence Null hypothesis is accepted

## Problem 3

In [9]:
customer=pd.read_csv('Costomer+OrderForm.csv')
customer.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [10]:
phillippines=pd.Series([len(customer[customer.Phillippines=='Error Free']),len(customer[customer.Phillippines=='Defective'])])
indonesia=pd.Series([len(customer[customer.Indonesia=='Error Free']),len(customer[customer.Indonesia=='Defective'])])
malta=pd.Series([len(customer[customer.Malta=='Error Free']),len(customer[customer.Malta=='Defective'])])
india=pd.Series([len(customer[customer.India=='Error Free']),len(customer[customer.India=='Defective'])])

In [11]:
customerNew=pd.DataFrame()
customerNew['phillippines']=phillippines
customerNew['indonesia']=indonesia
customerNew['malta']=malta
customerNew['india']=india

In [12]:
customerNew

   phillippines  indonesia  malta  india
0           271        267    269    280
1            29         33     31     20

In [13]:
stats.chi2_contingency(customerNew)

Chi2ContingencyResult(statistic=3.858960685820355, pvalue=0.2771020991233135, dof=3, expected_freq=array([[271.75, 271.75, 271.75, 271.75],
       [ 28.25,  28.25,  28.25,  28.25]]))

since p value is less than 0.05 hence reject null hypothesis and Alternate hypothesis is accepted.